In [36]:
import numpy as np
import json

import os
import sys
sys.path.append(os.path.join(sys.path[0], '../'))
os.environ['DJANGO_SETTINGS_MODULE'] = 'metro.settings'

import django
django.setup()

import sqlite3
conn = sqlite3.connect('db.sqlite3')
from map import models

In [37]:
import pandas as pd

df = pd.read_csv('../stations.csv')

In [38]:
df.head()

,id,latitude,longitude,name,display_name,zone,total_lines,rail
0,1,51.5028,-0.2801,Acton Town,Acton<br />Town,3.0,2,0
1,2,51.5143,-0.0755,Aldgate,NaN,1.0,2,0
2,3,51.5154,-0.0726,Aldgate East,Aldgate<br />East,1.0,2,0
3,4,51.5107,-0.0130,All Saints,All<br />Saints,2.0,1,0
4,5,51.5407,-0.2997,Alperton,NaN,4.0,1,0

In [40]:
df[df.name == 'Baker Street']

,id,latitude,longitude,name,display_name,zone,total_lines,rail
9,11,51.5226,-0.1571,Baker Street,Baker<br />Street,1.0,5,0

In [41]:
for i in range(len(df)):
    models.Station.objects.create(
        sid = df['id'][i],
        name = df['name'][i],
        latitude = df['latitude'][i],
        longitude = df['longitude'][i],
        zone = df['zone'][i],
        total_lines = df['total_lines'][i],
        rail = df['rail'][i]
    )

In [42]:
df = pd.read_csv('../routes.csv')

In [43]:
df

    line                     name  colour  stripe
0      1            Bakerloo Line  AE6017     NaN
1      3              Circle Line  FFE02B     NaN
2      6  Hammersmith & City Line  F491A8     NaN
3      7             Jubilee Line  949699     NaN
4     11            Victoria Line  0A9CDA     NaN
5      2             Central Line  F15B2E     NaN
6      4            District Line  00A166     NaN
7      5         East London Line  FBAE34     NaN
8      8        Metropolitan Line  91005A     NaN
9      9            Northern Line  000000     NaN
10    10          Piccadilly Line  094FA3     NaN
11    12     Waterloo & City Line  88D0C4     NaN
12    13  Docklands Light Railway  00A77E  FFFFFF

In [44]:
import math

In [45]:
for i in range(len(df)):
    models.Route.objects.create(
        rid = df['line'][i],
        name = df['name'][i],
        colour = df['colour'][i],
        stripe = df['stripe'][i] if type(df['stripe'][i]) == str else 'NULL'
    )

In [46]:
df = pd.read_csv('../lines2.csv')

In [24]:
len(df)

406

In [31]:
df[(df['station1'] == 11) | (df['station2'] == 11)]

     station1  station2  line  time
0          11       163     1     1
1          11       212     1     2
75         11        83     3     3
76         11       104     3     3
203        11        83     6     3
204        11       104     6     3
228        11        28     7     2
229        11       249     7     4
256        11        94     8     6
257        11       104     8     3

In [33]:
models.Line.objects.create(
            station1 = models.Station.objects.get(sid = df['station1'][1]),
            station2 = models.Station.objects.get(sid = df['station2'][1]),
            route_id = models.Route.objects.get(rid = df['line'][1]),
            time = df['time'][1]
        )

In [29]:
models.Station.objects.get(id=11)

In [47]:
for i in range(len(df)):
    try:
        models.Line.objects.create(
            station1 = models.Station.objects.get(sid = df['station1'][i]),
            station2 = models.Station.objects.get(sid = df['station2'][i]),
            route_id = models.Route.objects.get(rid = df['line'][i]),
            time = df['time'][i]
        )
    except:
        print(i)

In [33]:
df.iloc[351]

station1     31
station2    303
line         10
time          2
Name: 351, dtype: int64

In [34]:
df.iloc[389]

station1    266
station2    303
line         10
time          2
Name: 389, dtype: int64